# InSessionPrintSetting Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
InSessionPrintSetting Class
Members See Also
---
Represents the in-session Print Setup (Application Menu->Print->Print Setup) within Autodesk Revit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class InSessionPrintSetting : IPrintSetting,
	IDisposable
```

Visual Basic
---
```text
Public Class InSessionPrintSetting _
	Implements IPrintSetting, IDisposable
```

Visual C++
---
```text
public ref class InSessionPrintSetting : IPrintSetting,
	IDisposable
```

# Remarks
The in-session PrintSetting can't be stored in document.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..InSessionPrintSetting
# See Also
InSessionPrintSetting Members
Autodesk.Revit.DB Namespace